tap "borkdude/brew"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "eugenmayer/dockersync"
tap "getantibody/tap"
tap "getsentry/tools"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jmespath/jmespath"
tap "koekeishiya/formulae"
tap "mas-cli/tap"
tap "osx-cross/avr"
tap "px4/px4"
tap "teamookla/speedtest"
tap "unbounce/taps"
cask "adoptopenjdk8"
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Manage common tasks with OpenAL applications
brew "alure"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Shell extension to jump to frequently used directories
brew "autojump"
# ELF object file access library
brew "libelf"
# Library for USB device access
brew "libusb"
# Library for USB device access
brew "libusb-compat"
# Library to talk to FTDI chips
brew "libftdi0"
# Atmel AVR MCU programmer
brew "avrdude"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Extract files from Microsoft cabinet files
brew "cabextract"
# ASP system to ground and solve logic programs
brew "clingo"
# Statistics utility to count lines of code
brew "cloc"
# The Clojure Programming Language
brew "clojure"
# JavaScript optimizing compiler
brew "closure-compiler"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: true
# Secure runtime for JavaScript and TypeScript
brew "deno"
# OWASP dependency-check
brew "dependency-check"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# macOS Credential Helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Suite of tools for inspecting disk usage
brew "duc"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Non-strict, functional programming language in the spirit of Haskell
brew "frege"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Source code tag system
brew "global"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU typing tutor
brew "gnu-typist"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Haskell source code suggestions
brew "hlint"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Selection-based modal text editor
brew "kakoune"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Build tool for Clojure
brew "leiningen"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# GNOME XML library
brew "libxml2"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# File compressor
brew "lzop"
# Utility for directing compilation
brew "make"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Hash utilities
brew "md5sha1sum", link: false
# Run a Kubernetes cluster locally
brew "minikube"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql@5.6", link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Single-player roguelike video game
brew "nethack"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# GNU Portable THreads
brew "pth"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch", args: ["HEAD"]
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Tool to get valuable information out of AWS CloudTrail
brew "trailscraper"
# File synchronization tool for OSX
brew "unison"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Debugger for zsh
brew "zshdb"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-ctags", "with-dbus", "with-jansson", "with-mailutils", "with-modern-sexy-v1-icon", "with-no-frame-refocus", "with-no-titlebar", "with-xwidgets"]
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A layer for unison-fsmonitor arround either macfsevents or watchdog for usage with unison
brew "eugenmayer/dockersync/unox"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Command-line interface to JMESPath, a query language for JSON
brew "jmespath/jmespath/jp"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc", link: false
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@7", link: true
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi-49", link: false
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "unbounce/taps/iidy"
brew "unbounce/taps/stack-toolkit"
cask "adobe-acrobat-reader"
cask "adoptopenjdk11"
cask "bartender"
cask "chrysalis"
cask "discord"
cask "docker"
cask "firefox-developer-edition"
cask "font-cascadia"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-cascadia-pl"
cask "font-fantasquesansmono-nerd-font"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-hasklig-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-powerline"
cask "font-noto-serif"
cask "font-victor-mono"
cask "google-chrome-dev"
cask "gpg-suite"
cask "hammerspoon"
cask "java"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "kekadefaultapp"
cask "kitty"
cask "meld"
cask "nordvpn"
cask "postico"
cask "resilio-sync"
cask "sequel-pro"
cask "textexpander"
cask "unetbootin"
cask "virtualbox"
cask "zoomus"
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "Airmail", id: 918858936
mas "Be Focused Pro", id: 961632517
mas "Better", id: 1121192229
mas "Canary Mail", id: 1236045954
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Marked 2", id: 890031187
mas "MultiMarkdown Composer", id: 1275176220
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Save to Pocket", id: 1477385213
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "Things", id: 904280696
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
