tap "adoptopenjdk/openjdk"
tap "caskformula/caskformula"
tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "jmespath/jmespath"
tap "mas-cli/tap"
tap "osx-cross/avr"
tap "px4/px4"
tap "unbounce/taps"
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Real-time data compression library
brew "lzo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Manage common tasks with OpenAL applications
brew "alure"
# Java build tool
brew "ant"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# ELF object file access library
brew "libelf"
# Library for USB device access
brew "libusb"
# Library for USB device access
brew "libusb-compat"
# Library to talk to FTDI chips
brew "libftdi0"
# Atmel AVR MCU programmer
brew "avrdude"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Extract files from Microsoft cabinet files
brew "cabextract"
# ASP system to ground and solve logic programs
brew "clingo", link: false
# Statistics utility to count lines of code
brew "cloc"
# JavaScript optimizing compiler
brew "closure-compiler"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# Suite of tools for inspecting disk usage
brew "duc"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Small git utilities
brew "git-extras"
# Source code tag system
brew "global"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU typing tutor
brew "gnu-typist"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GPG key agent
brew "gpg-agent"
# GNU grep, egrep and fgrep
brew "grep"
# Generic library support script
brew "libtool"
# String tool
brew "intltool"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# GNOME XML library
brew "libxml2"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# File compressor
brew "lzop"
# Text-to-HTML conversion tool
brew "markdown"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Hash utilities
brew "md5sha1sum", link: false
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql@5.6"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Single-player roguelike video game
brew "nethack"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# PNG image optimizing utility
brew "pngquant"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch", args: ["HEAD"]
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-ctags", "with-dbus", "with-emacs-icons-project-EmacsIcon3", "without-spacemacs-icon"]
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# This is a Sentry command-line client for some generic tasks.
brew "getsentry/tools/sentry-cli"
# Command-line interface to JMESPath, a query language for JSON
brew "jmespath/jmespath/jp"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc", link: false
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@7", link: true
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi-49"
brew "unbounce/taps/iidy"
brew "unbounce/taps/stack-toolkit"
cask "font-fantasquesansmono-nerd-font"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "hammerspoon"
cask "java"
cask "unetbootin"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "adoptopenjdk/openjdk/adoptopenjdk11"
mas "Airmail", id: 918858936
mas "Be Focused Pro", id: 961632517
mas "Better", id: 1121192229
mas "Canary Mail", id: 1236045954
mas "CCMenu", id: 603117688
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "iA Writer", id: 775737590
mas "Marked 2", id: 890031187
mas "MultiMarkdown Composer", id: 1275176220
mas "OmniFocus", id: 1346203938
mas "Pixelmator", id: 407963104
mas "Skitch", id: 425955336
mas "SomaFM", id: 449155338
mas "Tweetbot", id: 557168941
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
