ack
adns
adwaita-icon-theme
alure
ant
apple-gcc42
aspcud
aspell
atk
autoconf
autojump
automake
avrdude
bash
bash-completion
boost
cabal-install
cairo
camlp4
cask
clingo
closure-compiler
cmake
cmatrix
colordiff
coreutils
cowsay
cscope
ctags
curl
dbus
dfu-programmer
dfu-util
dialog
dirmngr
doxygen
emacs
exercism
ffmpeg
findutils
flow
fontconfig
fortune
freetype
gcc
gdbm
gdk-pixbuf
gettext
ghc
gifsicle
gist
git
git-extras
git-flow
glib
global
gmp
gnu-tar
gnu-typist
gnupg
gnutls
go
gobject-introspection
gpg-agent
graphite2
grep
gsettings-desktop-schemas
gsl
gtk+
gtk+3
gtk-mac-integration
gtksourceview
gtksourceview3
harfbuzz
haskell-stack
hdf5
hicolor-icon-theme
htop
hub
icu4c
imagemagick
intltool
ios-webkit-debug-proxy
irssi
isl
jansson
jdnssec-tools
jemalloc
jenv
jpeg
jq
json-c
kubernetes-cli
kubernetes-helm
lame
libassuan
libcroco
libelf
libepoxy
libevent
libffi
libftdi0
libgcrypt
libgit2
libgpg-error
libidn
libidn2
libimobiledevice
libksba
libmpc
libplist
libpng
librsvg
libssh2
libtasn1
libtermkey
libtiff
libtool
libunistring
libusb
libusb-compat
libuv
libvterm
libxml2
libyaml
libyubikey
little-cms2
lua
luajit
lynx
lzo
lzop
makedepend
markdown
maven
md5sha1sum
memcached
mercurial
mosh
mpfr
msgpack
mtr
mysql
neovim
nettle
nmap
node@6
npth
numpy
ocaml
ocamlbuild
oniguruma
opam
openssh
openssl
openssl@1.1
p11-kit
pandoc
pango
parallel
pcre
perl
pinentry
pixman
pkg-config
pngquant
protobuf
pth
pv
py2cairo
pyenv
pyenv-virtualenvwrapper
pygobject
pygtk
python
python3
rbenv
readline
redis
ripgrep
rsync
ruby-build
shared-mime-info
shellcheck
sqlite
swig
szip
texinfo
the_platinum_searcher
the_silver_searcher
thefuck
tidy-html5
tmux
unibilium
usbmuxd
watch
wget
x264
xvid
xz
zsh
codeclimate/formulae/codeclimate
homebrew/php/composer
osx-cross/avr/avr-binutils
osx-cross/avr/avr-gcc
px4/px4/gcc-arm-none-eabi
px4/px4/gcc-arm-none-eabi-49
railwaycat/emacsmacport/emacs-mac
unbounce/taps/iidy
unbounce/taps/stack-toolkit
